Autodesk.Revit.DB.FillPatternElement.GetFillPatternElementByName(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FillPatternTarget,System.String)
Retrieves the FillPatternElement by its name.
document:
The document in which to retrieve the FillPatternElement.
target:
The FillPatternTarget of the FillPatternElement.
name:
The name of the FillPatternElement.
Returns:
The FillPatternElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
target must be Model or Drafting.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.FillPatternElement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FillPattern)
Creates a new FillPatternElement.
document:
The document in which to create the FillPatternElement.
fillPattern:
The FillPattern associated to the newly created FillPatternElement.
Returns:
The newly created FillPatternElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fillPattern does not have a valid Target.
-or-
fillPattern does not have a valid Name.
-or-
fillPattern is a solid fill pattern.
-or-
fillPattern contains FillGrids with a zero Offset.
-or-
The name of the fillPattern already exists.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.FillPatternElement.SetFillPattern(Autodesk.Revit.DB.FillPattern)
Sets the FillPattern associated to this element.
Remarks:
The data stored inside the input FillPattern will be copied into this element.
The input FillPattern itself will not be associated with the element.
newFillPattern:
The new FillPattern object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
newFillPattern does not have a valid Target.
-or-
newFillPattern does not have a valid Name.
-or-
newFillPattern is a solid fill pattern.
-or-
newFillPattern contains FillGrids with a zero Offset.
-or-
The name of the newFillPattern already exists.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element is the build-in solid fill pattern element and can not be modified.
Since:
2012